//Напишите программ, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя)

//int num = int.Parse(Console.ReadLine ());
//int numResult = num * num;
///Console.WriteLine(numResult);
// пример функции по нахождению степени double numResult = Math.Pow(num, 5);


int a = 5;
int b = 25;
int numResult = b / a;
Console.WriteLine (numResult);

if (numResult == a)
{
    Console.WriteLine( "Является квадратом.");
}
else 
{
    Console.WriteLine( " Не является квадратом.");
}