//Напишите программ, которая на вход
// принимает число и выдаёт его квадрат (число
// умноженное на само себя)

int num = 5;
int numResult = num * num;
Console.WriteLine(numResult);
// пример функции по нахождению степени double numResult = Math.Pow(num, 5);

